{"content":"My name is Taylor and I am 28 year old born and raised Oregonian. Welcome to my blog, I am glad you are here. I recently made a decision to take back control of my life and quit my job of nine years in to travel the world. I know that at some point people close to me or people that don’t know me yet, will read this and think, “What does she mean take back control of her life?”\n\n\n\nIf you would have asked me a year ago if I thought I would be sitting here sharing my experiences in the blog you are reading today, I would have probably responded with some smart ass response like “why would someone care to read what I have to say?” and then think to myself about how unrealistic it would be to travel for more than a few weeks without a job or a source of income.\n\n\n\nI have been working since I was 16 years old and have been making a decent income ever since. When I later started what I thought could be a career in property management at 19, I had not idea that I would grow as fast as I did in the industry. To those in the industry, you will understand when I say to some degree property management “sucks you in.” The pay is good and bonus potential is high. My salary and my four weeks vacation accrued annually allowed me to discover my love for travel and culture. Up until this point in my life I have travelled to other parts of the US, Mexico, Costa Rica, Dominican Republic, Greece, and Italy. \n\n\n\nA year ago my cousin and his wife sold their home in Eugene and decided to move to Portland to live in the apartment community that I managed up until this point in my life. They wanted to get taste of city life before taking off on the journey of a lifetime. \n\n\n\nI remember when they first told me of their plans to quit their jobs and travel the world. And I remember thinking, “oh man, I wish I could do something that.” But what about my job, my car payment, and bills? What about my dogs and my boyfriend? The thought of quitting my job, packing up a bag, and traveling the world seemed borderline insane.  \n\n\n\nFast forward a few months, my cousin and his wife began to discuss their plans and I began to think to myself, what if I could do this too? What would I have to do to make it happen? It started with me selling my old clothing online. I was able to sell stuff that I already had, to purchase all of the gear that I needed for my trip. I wanted to try out changing my lifestyle and spending habits through minimizing what I already had. I was able to see that very early on I saved a lot of money. I put myself on a budget and tried my best to stick to it. \n\n\n\nNow this doesn’t mean that I stopped exploring and eating my way through Portland, because trust me, I did. I mean the food scene here is unreal! Check out my Travel PDX link for more information on my recommended hot spots and happy hours. \n\n\n\nThe past two years of my life I recognized a shift in my personal happiness and what I believe to be my purpose in life. If you know me, you know that I am a very spiritual person and I believe that there is a reason for everything. I believe that we are faced with difficult situations in our lives to learn from and move forward. I know I can sit here today and say that I am the woman that I am today because of my past experiences, good and bad. \n\n\n\nI began to realize that a large portion of my unhappiness was because of my job. Property management is extremely stressful. There would be days that would end in tears. Weekly I would faced with challenges and my energy level depleted. I found myself becoming easily bothered by people that would overact over a broken elevator or a coffee station that was out of coffee cups. I remember one day listening to someone complain and I completely tuned them out. That was so unlike me. I consider myself an extremely caring and sympathetic person, but my job was changing me and I didn’t like that. I started seeing what I thought was a career morph into something that was just temporary. I was unhappy, stressed, and unhealthy. I knew I needed to make a change. \n\n\n\nToday as I share this with you, I know I have a very special woman to thank for sharing with me a book that would provide me with the inspiration to start this very incredible journey. This very special woman gifted me a book by Tosha Silver titled “Outrageous Openness, Letting the Divine Take the Lead.”\n\n\n\nThe book was the inspiration for the title of this blog as it encourages all of us to say it’s okay to sometimes let go and trust that everything will be okay. When our agendas and egos are released, we make room for the universe to take the lead. I talk a lot about manifesting the things that I want and I think there is a lot of power in knowing that sometimes if you ask for something and really think on it, it in some way or another will appear in your life. I feel blessed everyday and thankful for all the precious gifts that life and the universe has offered to me up until this point in my life. And I can’t wait to see what else is in store and what else I will learn about myself as I embark on this journey. \n\n\n\nI hope that if you have read and made it this far that you continue to follow me on this journey and find some inspiration to simply roam the divine in pursuit of your own happiness too. I would love for you to reach out to me if you have questions about any of the destinations that we share with you or about my life and how I got to where I am today. I think the best gift that we can share with on another is our gift of love and support. We are one people and together we have the power to truly make a difference, not just in our own lives, but in the lives of others too. "}